# Данная скобочная последовательность [((())()(())]] не является правильной,
# так как у неё неправильно расставлены скобки. Для того чтобы сделать её правильной,
# необходимо изменить закрывающую квадратную скобку ] на закрывающую круглую скобку ),
# либо удалить одну ) и одну ]:
#
# Правильная последовательность: [((())()(()))] или [(())()(())]
# Пример с первый вариантом:
# var_2 = [1,(2,(3,(4)),(5),(6,(7),8),9),10]
# print(var_2[1][1])
# Пример с вторым вариантом:
# var = [1,(2,(3),12),(4),(17,(28),17),8]
# print(len(var))


